In [21]:
import pandas as pd

from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base

from db import engine

import os

### Question 1

In [22]:
try:
    os.remove("db/db_argent.sqlite")
    print('Base de données argent supprimée.')
except:
    print('Pas de base de données argent.')

Pas de base de données argent.

In [23]:
base = declarative_base()
engine_argent = create_engine("sqlite:///db/db_argent.sqlite", echo=True)
base.metadata.create_all(engine_argent)

2022-12-10 00:22:08,351 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-10 00:22:08,352 INFO sqlalchemy.engine.Engine COMMIT

In [26]:
employees = pd.io.sql.read_sql("select resto.pays, substr(resto.code_postal , 0, 3) as code_postal, count(employe.nom) from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'Employee' as employe on employe.code_postal=resto.code_postal group by pays.pays, employe.code_postal", con=engine)

employees

2022-12-10 00:23:29,168 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("select resto.pays, substr(resto.code_postal , 0, 3) as code_postal, count(employe.nom) from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'Employee' as employe on employe.code_postal=resto.code_postal group by pays.pays, employe.code_postal")
2022-12-10 00:23:29,169 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-10 00:23:29,171 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("select resto.pays, substr(resto.code_postal , 0, 3) as code_postal, count(employe.nom) from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'Employee' as employe on employe.code_postal=resto.code_postal group by pays.pays, employe.code_postal")
2022-12-10 00:23:29,172 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-10 00:23:29,174 INFO sqlalchemy.engine.Engine select resto.pays, substr(resto.code_postal , 0, 3) as code_postal, count(employe.nom) from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'Employee' as employe on employe.code_postal=resto.code_postal group by pays.pays, employe.code_postal
2022-12-10 00:23:29,175 INFO sqlalchemy.engine.Engine [raw sql] ()

          pays code_postal  count(employe.nom)
0    Australia          14                  24
1    Australia          24                  18
2    Australia          33                  15
3    Australia          46                  18
4    Australia          76                  11
..         ...         ...                 ...
245    Vietnam          81                  15
246    Vietnam          82                  13
247    Vietnam          85                  17
248    Vietnam          93                  11
249    Vietnam          93                  15

[250 rows x 3 columns]

In [27]:
employees.to_sql(name='EmployePays', con=engine_argent, if_exists = 'append', index=False)

2022-12-10 00:23:29,280 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("EmployePays")
2022-12-10 00:23:29,281 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-10 00:23:29,283 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-10 00:23:29,287 INFO sqlalchemy.engine.Engine INSERT INTO "EmployePays" (pays, code_postal, "count(employe.nom)") VALUES (?, ?, ?)
2022-12-10 00:23:29,288 INFO sqlalchemy.engine.Engine [generated in 0.00254s] (('Australia', '14', 24), ('Australia', '24', 18), ('Australia', '33', 15), ('Australia', '46', 18), ('Australia', '76', 11), ('Australia', '85', 18), ('Australia', 'S8', 19), ('Austria', '10', 13)  ... displaying 10 of 250 total bound parameter sets ...  ('Vietnam', '93', 11), ('Vietnam', '93', 15))
2022-12-10 00:23:29,291 INFO sqlalchemy.engine.Engine COMMIT
2022-12-10 00:23:29,296 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-10 00:23:29,297 INFO sqlalchemy.engine.Engine [raw sql] ()

250

In [28]:
employees.to_sql(name='EmployePaysValue', con=engine_argent, if_exists = 'append', index=False)

2022-12-10 00:23:29,364 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("EmployePaysValue")
2022-12-10 00:23:29,366 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-10 00:23:29,367 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("EmployePaysValue")
2022-12-10 00:23:29,368 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-10 00:23:29,371 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-10 00:23:29,372 INFO sqlalchemy.engine.Engine
CREATE TABLE "EmployePaysValue" (
	pays TEXT,
	code_postal TEXT,
	"count(employe.nom)" BIGINT
)


2022-12-10 00:23:29,372 INFO sqlalchemy.engine.Engine [no key 0.00076s] ()
2022-12-10 00:23:29,379 INFO sqlalchemy.engine.Engine COMMIT
2022-12-10 00:23:29,381 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2022-12-10 00:23:29,384 INFO sqlalchemy.engine.Engine INSERT INTO "EmployePaysValue" (pays, code_postal, "count(employe.nom)") VALUES (?, ?, ?)
2022-12-10 00:23:29,385 INFO sqlalchemy.engine.Engine [generated in 0.00194s] (('Australia', '14', 24), ('Australia', '24', 18), ('Australia', '33', 15), ('Australia', '46', 18), ('Australia', '76', 11), ('Australia', '85', 18), ('Australia', 'S8', 19), ('Austria', '10', 13)  ... displaying 10 of 250 total bound parameter sets ...  ('Vietnam', '93', 11), ('Vietnam', '93', 15))
2022-12-10 00:23:29,387 INFO sqlalchemy.engine.Engine COMMIT
2022-12-10 00:23:29,393 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-12-10 00:23:29,393 INFO sqlalchemy.engine.Engine [raw sql] ()

250

### Question 2

In [29]:
menu = pd.io.sql.read_sql("select distinct resto.pays, resto.code_postal, count(id_item), ingredient.ingredient from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'CarteItem' as carte_item on resto.pays=carte_item.pays join 'Item' as item on carte_item.id_item=item.nom_item join 'Recette' as recette on item.nom_item=recette.nom_item join 'Ingredient' as ingredient on recette.ingredient=ingredient.ingredient group by id_item order by count(id_item) desc", con=engine)

menu

2022-12-10 00:23:29,468 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("select distinct resto.pays, resto.code_postal, count(id_item), ingredient.ingredient from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'CarteItem' as carte_item on resto.pays=carte_item.pays join 'Item' as item on carte_item.id_item=item.nom_item join 'Recette' as recette on item.nom_item=recette.nom_item join 'Ingredient' as ingredient on recette.ingredient=ingredient.ingredient group by id_item order by count(id_item) desc")
2022-12-10 00:23:29,469 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-10 00:23:29,471 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("select distinct resto.pays, resto.code_postal, count(id_item), ingredient.ingredient from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'CarteItem' as carte_item on resto.pays=carte_item.pays join 'Item' as item on carte_item.id_item=item.nom_item join 'Recette' as recette on item.nom_item=recette.nom_item join 'Ingredient' as ingredient on recette.ingredient=ingredient.ingredient group by id_item order by count(id_item) desc")
2022-12-10 00:23:29,472 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-12-10 00:23:29,473 INFO sqlalchemy.engine.Engine select distinct resto.pays, resto.code_postal, count(id_item), ingredient.ingredient from 'Restaurant' as resto join 'Pays' as pays on resto.pays=pays.pays join 'CarteItem' as carte_item on resto.pays=carte_item.pays join 'Item' as item on carte_item.id_item=item.nom_item join 'Recette' as recette on item.nom_item=recette.nom_item join 'Ingredient' as ingredient on recette.ingredient=ingredient.ingredient group by id_item order by count(id_item) desc
2022-12-10 00:23:29,474 INFO sqlalchemy.engine.Engine [raw sql] ()

            pays code_postal  count(id_item)  ingredient
0        Vietnam   93956-418             155     fromage
1          China       45331             155        fish
2          Spain      164486             145     fromage
3        Vietnam   93956-418             145     fromage
4        Vietnam   93956-418             145   cornichon
..           ...         ...             ...         ...
95        Brazil      547166              56  croustille
96         India      425464              55     fromage
97  South Africa     G27 7HT              50     fromage
98      Colombia     7443 YD              44  croustille
99   Netherlands      452654              36  croustille

[100 rows x 4 columns]